CSI API ETABS v1
cHelper.GetOAPIVersionNumber Method
 Retrieves the API version.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
double GetOAPIVersionNumber()
Function GetOAPIVersionNumber As Double
Dim instance As cHelper
Dim returnValue As Double
returnValue = instance.GetOAPIVersionNumber()
double GetOAPIVersionNumber()
abstract GetOAPIVersionNumber : unit -> float
Return Value
Type: Double
The API version.
Remarks
The returned API version can be compared to GetOAPIVersionNumber() to determine compatibility with the program.
Examples
Public Sub Example()
    Dim myHelper As cHelper
    Dim EtabsObject As cOAPI
    Dim clientAPIVersion As Double
    Dim programAPIVersion As Double
    Dim ret As Integer = -1
    'create ETABS object
    myHelper = New Helper
    EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
    'start ETABS application
    ret = EtabsObject.ApplicationStart()
    'get client API version
    clientAPIVersion = myHelper.GetOAPIVersionNumber()
    'get program API version
    programAPIVersion = EtabsObject.GetOAPIVersionNumber()
    'API compatibility check
    If clientAPIVersion > programAPIVersion Then
        'API client uses a newer version of the API than the program.
        'All API functionality may be not be available.
        Exit Sub
    End If
    'close ETABS
    EtabsObject.ApplicationExit(False)
    'clean up variables
    EtabsObject = Nothing
    myHelper = Nothing
End Sub
See Also
Reference
cHelper Interface
ETABSv1 Namespace